mauro-medina10/dsPIC33F_FreeRTOS_Anemometro_v1/Demo/dsPIC33F_MPLAB/main.c
/*
 * File:   main.c
 * Author: MWA692
 *
 * Created on July 20, 2020, 2:46 PM
 */
#ifndef __dsPIC33FJ128GP802__
#define __dsPIC33FJ128GP802__
#endif

/*Standars includes*/
#include <stdint.h>
#include <stdio.h> 
#include <dsp.h>

/*Config includes*/
#include "xc.h"
#include <config.h>

/*FreeRTOS includes*/
#include "FreeRTOS.h"
#include "FreeRTOSConfig.h"
#include "list.h"
#include "queue.h"
#include "task.h"
#include "timers.h"
#include "semphr.h"

/*Peripherals drivers includes*/
#include <anemometroDef.h>
#include <adc.h>
#include <pwm.h>
#include <UART_RTOS.h>
#include <timer.h>

/*Funciones locales*/
static void prvSetupHardware(void);

/*--------Tasks declaration---------*/
//static void led_test_task(void *pvParameters);
//static void transductor_test_task(void *pvParameters);

static void anemometro_main_task(void *pvParameters);

/*FreeRTOS declarations*/
static TaskHandle_t xMainTaskHandle = NULL;
static QueueHandle_t qRecf;

/*Global variables*/
float detect_delta_O = DETECTION_ERROR_O;
float detect_delta_E = DETECTION_ERROR_E;
float detect_delta_N = DETECTION_ERROR_N;
float detect_delta_S = DETECTION_ERROR_S;

anemometro_mode_enum anemometroModoActivo = Menu;

uint8_t medProgFlag = 0;
uint8_t medAborted = 0;

int main(void) {
    //Inicio Hardware
    prvSetupHardware();

    //Output compare
    comparadorInit();
    //    comparador_rtos_init();

    //ADC init
    adc_init();

    //UART init
    uartInit_RTOS();
    //    uartInit();
    //Timer 32bits
    timerInit();

    //Queues init
    qRecf = xQueueCreate(5, sizeof (float));

    if (qRecf == NULL) {
        while (1);
    }

    //FreeRTOS inits
    if (xTaskCreate(anemometro_main_task,
            "anemometro_main_task",
            configMINIMAL_STACK_SIZE * 3,
            NULL,
            tskIDLE_PRIORITY + 3,
            &xMainTaskHandle) != pdPASS) {
        while (1);
    }

    LED_OFF;

    vTaskStartScheduler();

    while (1);

    return 0;
}

static void anemometro_main_task(void *pvParameters) {
    wind_medicion_type abortMed = {9995.99, 9995.99};
    anemometro_config_enum configOption = ExitConfig;
    wind_medicion_type simpleMed = {0, 0};
    mux_transSelect_enum emisorSelect = TRANS_EMISOR_OESTE;
    uint16_t auxV = 0;
    TickType_t xLastWakeTime;
    unsigned int firstPeriodFlag = 1;
    float soundSpeed = 345.7;
    float coordVmed[2];
    uint32_t medPeriod = 10;
    BaseType_t medState = pdFAIL;

    MUX_INPUT_INH(0);

    DELAY_50uS;

    LED_ON;

    while (1) {
        switch (anemometroModoActivo) {
            case Menu:
                //Bandera para inciar medicion periodica
                firstPeriodFlag = 1;
                //Enum del menu configuracion
                configOption = ExitConfig;
                //Espero a que se elija un modo de func
                anemometroModoActivo = uartGetMode();
                //Variables auxiliares para mediciones varias
                if (emisorSelect > TRANS_EMISOR_SUR) emisorSelect = TRANS_EMISOR_OESTE;
                auxV = 0;

                break;
            case Medicion_Simple:

                medState = anemometroVmedian(&coordVmed[0], &coordVmed[1]);

                if (medState == pdPASS) {
                    simpleMed = anemometroGetMed(coordVmed[0], coordVmed[1]);

                    medState = pdFAIL;
                } else {
                    sprintf(simpleMed.coord, " F ");
                }

                uartSendMed(&simpleMed);

                anemometroModoActivo = Menu;
                break;
            case Medicion_Continua:

                if (firstPeriodFlag == 1) {
                    xLastWakeTime = xTaskGetTickCount();
                    firstPeriodFlag = 0;
                }

                medProgFlag = 1;

                if (anemometroVmedian(&coordVmed[0], &coordVmed[1]) == pdPASS) {

                    simpleMed = anemometroGetMed(coordVmed[0], coordVmed[1]);

                } else {
                    sprintf(simpleMed.coord, " F ");
                }

                uartSendMed(&simpleMed);

                //                auxV++;
                //                if (auxV >= 7) {
                //                    auxV = 0;
                //                    //                    emisorSelect++;
                //                    //                    emisorSelect += 2;
                //                    if (emisorSelect > TRANS_EMISOR_SUR) {
                //                        emisorSelect = TRANS_EMISOR_OESTE;
                //                        //                        uartEndMode();
                //                    }
                //                    uartEndMode();
                //                }
                //                vTaskDelay(10 / portTICK_PERIOD_MS);

                anemometroModoActivo = uartGetMode();

                medProgFlag = 0;

                if (anemometroModoActivo == Medicion_Continua) {
                    vTaskDelayUntil(&xLastWakeTime, (medPeriod * 1000) / portTICK_PERIOD_MS);
                }

                break;
            case Configuracion:
                configOption = uartGetModeConfig();

                switch (configOption) {
                    case CalCero:
                        xQueueReceive(qRecf, &soundSpeed, portMAX_DELAY);

                        //                        anemometroDelayTest();
                        if (soundSpeed == 999.99) {
                            detect_delta_O = (float) DETECTION_ERROR_O;
                            detect_delta_E = (float) DETECTION_ERROR_E;
                            detect_delta_N = (float) DETECTION_ERROR_N;
                            detect_delta_S = (float) DETECTION_ERROR_S;
                        } else {
                            anemometroCalibCero(soundSpeed);
                        }

                        simpleMed.mag = detect_delta_O * 1000000;
                        simpleMed.deg = detect_delta_E * 1000000;
                        uartSendMed(&simpleMed);

